SELECT DISTINCT
  s.ФАМИЛИЯ_СОТРУДНИКА || ' ' || s.ИМЯ_СОТРУДНИКА || ' ' || s.ОТЧЕСТВО_СОТРУДНИКА AS "ФИО"
FROM УЧАСТОК u
  JOIN ЦЕХ c
    ON u.НОМЕР_ЦЕХА = c.НОМЕР_ЦЕХА
  JOIN НАЧАЛЬНИК_ЦЕХА w
    ON c.НОМЕР_ДОГОВОРА = w.НОМЕР_ДОГОВОРА
  JOIN НАЧАЛЬНИК_УЧАСТКА n
    ON u.НОМЕР_ДОГОВОРА = n.НОМЕР_ДОГОВОРА
  JOIN МАСТЕР_НАЧАЛЬНИК m
    ON n.НОМЕР_ДОГОВОРА = m.ДОГОВОР_НАЧ_УЧ
  JOIN МАСТЕР_БРИГАДА b
    ON m.ДОГОВОР_МАСТЕР = b.НОМЕР_ДОГОВОРА
  JOIN РАБОЧИЙ r
    ON b.ИД_БРИГАДЫ = r.ИД_БРИГАДЫ
  JOIN СОТРУДНИК s
    ON r.НОМЕР_ДОГОВОРА = s.НОМЕР_ДОГОВОРА
       OR m.ДОГОВОР_МАСТЕР = s.НОМЕР_ДОГОВОРА
       OR n.НОМЕР_ДОГОВОРА = s.НОМЕР_ДОГОВОРА
       OR w.НОМЕР_ДОГОВОРА = s.НОМЕР_ДОГОВОРА

WHERE u.НОМЕР_УЧАСТКА = (
  SELECT DISTINCT q.НОМЕР_УЧАСТКА
  FROM УЧАСТОК_КАТЕГОРИЯ_ИЗДЕЛИЯ q
  MINUS
  SELECT l.НОМЕР_УЧАСТКА
  FROM (SELECT
          НОМЕР_УЧАСТКА,
          COUNT(*) AS counted
        FROM УЧАСТОК_КАТЕГОРИЯ_ИЗДЕЛИЯ
        GROUP BY НОМЕР_УЧАСТКА) k
    JOIN (SELECT
            НОМЕР_УЧАСТКА,
            COUNT(*) AS counted
          FROM УЧАСТОК_КАТЕГОРИЯ_ИЗДЕЛИЯ
          GROUP BY НОМЕР_УЧАСТКА) l
      ON k.counted > l.counted);

