DEFINE min_time = to_date('2014/07/22', 'yyyy/mm/dd');
DEFINE max_time = to_date('2018/07/22', 'yyyy/mm/dd');

SELECT UNIQUE
  k.НАЗВАНИЕ_КАТЕГОРИИ_ИЗДЕЛИЯ AS "Категория",
  i.НАЗВАНИЕ_ВИДА_ИЗДЕЛИЯ      AS "Вид",
  COUNT(z.ПОЗИЦИЯ_В_ЖУРНАЛЕ)   AS "Кол-во"

FROM ВИД_ИЗДЕЛИЯ i
  LEFT JOIN ЖУРНАЛ z
    ON i.ИД_ВИДА_ИЗДЕЛИЯ = z.ИД_ВИДА_ИЗДЕЛИЯ
       AND z.ЗАВЕРШЕНИЕ <= to_date('2018/07/22', 'yyyy/mm/dd')
       AND z.ЗАВЕРШЕНИЕ >= to_date('2013/07/22', 'yyyy/mm/dd')
  LEFT JOIN УЧАСТОК u
    ON z.НОМЕР_УЧАСТКА = u.НОМЕР_УЧАСТКА
       AND u.ТИП_УЧАСТКА = 'Сборка'
  JOIN КАТЕГОРИЯ_ИЗДЕЛИЯ k
    ON k.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ = i.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ

GROUP BY k.НАЗВАНИЕ_КАТЕГОРИИ_ИЗДЕЛИЯ, i.НАЗВАНИЕ_ВИДА_ИЗДЕЛИЯ, z.ПОЗИЦИЯ_В_ЖУРНАЛЕ

UNION ALL
SELECT
  'Всего собрано (' || to_date('2013/07/22', 'yyyy/mm/dd') || '-' || to_date('2018/07/22', 'yyyy/mm/dd') || '):',
  '',
  COUNT(*)
FROM ЖУРНАЛ z
  JOIN УЧАСТОК u
    ON z.НОМЕР_УЧАСТКА = u.НОМЕР_УЧАСТКА
       AND u.ТИП_УЧАСТКА = 'Сборка'
WHERE z.ЗАВЕРШЕНИЕ <= to_date('2018/07/22', 'yyyy/mm/dd')
      AND z.ЗАВЕРШЕНИЕ >= to_date('2013/07/22', 'yyyy/mm/dd');

