SELECT
  o.НОМЕР_ЦЕХА,
  o.НАЗВАНИЕ_ЦЕХА,
  COUNT(*) AS "Кол-во видов изделий",
  i.res    AS "Среднее кол-во видов изделий"
FROM УЧАСТОК p
  JOIN ЦЕХ o
    ON p.НОМЕР_ЦЕХА = o.НОМЕР_ЦЕХА
  CROSS JOIN (SELECT AVG(C) res
              FROM (
                SELECT COUNT(x.НОМЕР_УЧАСТКА) C
                FROM УЧАСТОК_КАТЕГОРИЯ_ИЗДЕЛИЯ x
                  JOIN ВИД_ИЗДЕЛИЯ y
                    ON x.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ = y.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ
                GROUP BY x.НОМЕР_УЧАСТКА)) i
  JOIN УЧАСТОК_КАТЕГОРИЯ_ИЗДЕЛИЯ u
    ON p.НОМЕР_УЧАСТКА = u.НОМЕР_УЧАСТКА
  JOIN ВИД_ИЗДЕЛИЯ v
    ON u.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ = v.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ

WHERE p.НОМЕР_УЧАСТКА = ANY (
  SELECT u.НОМЕР_УЧАСТКА
  FROM ЦЕХ C
    JOIN УЧАСТОК u
      ON C.НОМЕР_ЦЕХА = u.НОМЕР_ЦЕХА
    JOIN УЧАСТОК_КАТЕГОРИЯ_ИЗДЕЛИЯ q
      ON u.НОМЕР_УЧАСТКА = q.НОМЕР_УЧАСТКА
    JOIN ВИД_ИЗДЕЛИЯ v
      ON q.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ = v.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ
  GROUP BY u.НОМЕР_УЧАСТКА
  HAVING COUNT(u.НОМЕР_УЧАСТКА) > ANY (
    SELECT AVG(kek)
    FROM (
      SELECT COUNT(x.НОМЕР_УЧАСТКА) AS kek
      FROM УЧАСТОК_КАТЕГОРИЯ_ИЗДЕЛИЯ x
        JOIN ВИД_ИЗДЕЛИЯ y
          ON x.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ = y.ИД_КАТЕГОРИИ_ИЗДЕЛИЯ
      GROUP BY x.НОМЕР_УЧАСТКА))
)

GROUP BY o.НОМЕР_ЦЕХА, o.НАЗВАНИЕ_ЦЕХА, i.res, p.НОМЕР_УЧАСТКА;
